In [ ]:
# merge to join dataframes horizontally, concat to join dataframes vertically

In [2]:
import pandas as pd

In [3]:
##
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])

student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])

In [8]:
staff_df.set_index("Name", inplace = True)

In [9]:
student_df.set_index('Name', inplace = True)

In [10]:
pd.merge(staff_df, student_df, how ='outer', left_index = True, right_index = True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [11]:
pd.merge(staff_df, student_df, how ='inner', left_index = True, right_index = True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [14]:
pd.merge(staff_df, student_df, how ='left', left_index = True, right_index = True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

In [15]:
pd.merge(staff_df, student_df, how ='right', left_index = True, right_index = True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

In [16]:
staff_df.reset_index(inplace = True)

In [18]:
staff_df.head()

    Name            Role
0  Kelly  Director of HR
1  Sally  Course liasion
2  James          Grader

In [19]:
student_df.reset_index(inplace = True)

In [20]:
student_df.head()

    Name       School
0  James     Business
1   Mike          Law
2  Sally  Engineering

In [21]:
pd.merge(staff_df, student_df, how='outer', on = 'Name')

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally  Course liasion  Engineering
2  James          Grader     Business
3   Mike             NaN          Law

In [23]:
pd.merge(staff_df, student_df, how='left', on = 'Name')

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally  Course liasion  Engineering
2  James          Grader     Business